*** mu4e
#+BEGIN_SRC emacs-lisp
  ;;; mu4e-configs.el --- My mu4e configs
  ;;
  ;; Reference:
  ;; http://kirang.in/2014/11/13/emacs-as-email-client-with-offlineimap-and-mu4e-on-osx/

  ;; Re-enable C-x m for email (nerfs eshell, which I never use)
  (global-set-key (kbd "C-x m") 'compose-mail)

  ;; Load mu4e
  (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/mu4e")

  ;; Requirements and setup
  (require 'mu4e)
  (require 'mu4e-maildirs-extension) ;; Get a maildirs view in the mu4e-summary
  (require 'mu4e-contrib) ;; For nicely formatted HTML emails
  (require 'org-mu4e)    ;; Save mu4e messages as org links

  ;; Basic mu4e configuration
  (setq mu4e-maildir "~/.Mail"
        mu4e-drafts-folder "/gastove@gmail.com/[Gmail].Drafts"
        mu4e-sent-folder   "/gastove@gmail.com/[Gmail].Sent Mail"

        ;; don't save message to Sent Messages, Gmail/IMAP/Offlineimap takes care of this
        mu4e-sent-messages-behavior 'delete

        ;; allow for updating mail using 'U' in the main view:
        mu4e-get-mail-command "offlineimap"

        ;; Make mu4e the default user agent
        mail-user-agent 'mu4e-user-agent

        ;; fetch mail every 10 mins
        mu4e-update-interval 600

        ;; Name, main email address
        user-mail-address "gastove@gmail.com"
        user-full-name  "Ross Donaldson"

        ;; Signature
        mu4e-compose-signature (concat "Cheers,\n"
                                       "Ross\n")

        ;; ISO date format for headers
        mu4e-headers-date-format "%Y-%m-%d"

        ;; Convert HTML emails to nicely readable text
        mu4e-html2text-command 'mu4e-shr2text

        ;; If the same email is in two different folders, don't show it twice
        ;; in search results
        mu4e-headers-skip-duplicates t)


  ;; show images. unclear if this works.
  (setq mu4e-show-images t)

  ;; use imagemagick, if available
  (when (fboundp 'imagemagick-register-types)
    (imagemagick-register-types))


  ;; Get a view of unread messages by maildir in the summary view
  (mu4e-maildirs-extension)

  ;; add option to view html message in a browser
  ;; `aV` in view to activate
  (add-to-list 'mu4e-view-actions
               '("ViewInBrowser" . mu4e-action-view-in-browser) t)



  ;; configuration for sending mail
  (setq message-send-mail-function
        ;; Send via postfix
        'sendmail-send-it

        ;; By default, the gnus composer (which mu4e uses also) doesn't correctly
        ;; write FROM headers. Let's fix that. (Required to correctly dispatch to
        ;; multiple sending accounts with postfix.)
        mail-specify-envelope-from t
        mail-envelope-from 'header)

  ;; Message Composition settings
  (add-hook 'mu4e-compose-mode-hook
            (lambda ()
              (auto-fill-mode -1)
              (whitespace-mode -1)))

  ;; The mu4e interface
  ;; Single-character shortcuts
  (setq mu4e-maildir-shortcuts
        '(("/gastove@gmail.com/INBOX"               . ?i)
          ("/gastove@gmail.com/[Gmail].Important"   . ?I)
          ("/gastove@gmail.com/[Gmail].Sent Mail"   . ?s)))


  ;; Tweak bookmarked queries
  (add-to-list 'mu4e-bookmarks `(,(string-join
                                   '("flag:unread"
                                     "AND date:today..now"
                                     "NOT maildir:/ross@urbanairship.com/Githubs"
                                     "NOT maildir:'/ross@urbanairship.com/Sales Deals'"
                                     "AND m:/ross@urbanairship.com/INBOX")
                                   " ")
                                 "Today's work unreads" ?i))
  (add-to-list 'mu4e-bookmarks `(,(string-join
                                   '("flag:unread"
                                     "AND m:/gastove@gmail.com/INBOX"
                                     "AND date:today..now")
                                   " ") "Today's Personal Unreads" ?h))
  (add-to-list 'mu4e-bookmarks `(,(string-join
                                   '("flag:unread"
                                     "AND m:/gastove@gmail.com/INBOX"
                                     "AND date:today..now"
                                     "OR flag:unread"
                                     "AND m:/ross@urbanairship.com/INBOX"
                                     "AND date:today..now")
                                   " ") "Today's Unreads" ?u))

  ;; Switch accounts
  (defvar my-mu4e-account-alist
    '(("gastove@gmail.com"
       (mu4e-drafts-folder "/gastove@gmail.com/[Gmail].Drafts")
       (mu4e-sent-folder   "/gastove@gmail.com/[Gmail].Sent Mail")
       (user-mail-address "gastove@gmail.com"))
      ("ross@urbanairship.com"
       (mu4e-drafts-folder "/ross@urbanairship.com/[Gmail].Drafts")
       (mu4e-sent-folder   "/ross@urbanairship.com/[Gmail].Sent Mail")
       (user-mail-address "ross@urbanairship.com"))))

  (defun my-mu4e-set-account ()
    "Set the account for composing a message."
    (let* ((account
            (if mu4e-compose-parent-message
                (let ((maildir (mu4e-message-field mu4e-compose-parent-message :maildir)))
                  (string-match "/\\(.*?\\)/" maildir)
                  (match-string 1 maildir))
              (completing-read (format "Compose with account: (%s) "
                                       (mapconcat #'(lambda (var) (car var))
                                                  my-mu4e-account-alist "/"))
                               (mapcar #'(lambda (var) (car var)) my-mu4e-account-alist)
                               nil t nil nil (caar my-mu4e-account-alist))))
           (account-vars (cdr (assoc account my-mu4e-account-alist))))
      (if account-vars
          (mapc #'(lambda (var)
                    (set (car var) (cadr var)))
                account-vars)
        (error "No email account found"))))

  (add-hook 'mu4e-compose-pre-hook 'my-mu4e-set-account)
#+END_SRC

#+RESULTS:
| my-mu4e-set-account |

*** GGTags
Provides considerably better definition lookup in a lot of languages; p. good
for the Jabbas, Shell, and a bunch of things I don't have to read like C.
#+BEGIN_SRC emacs-lisp
  ;; C, C++, and Java
  (add-hook 'c-mode-common-hook
            (lambda ()
              (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
                (ggtags-mode 1))))

  ;; Python
  (add-hook 'python-mode-hook
            (lambda ()
              (ggtags-mode 1)))

  ;; Shell
  (add-hook 'sh-mode-hook
            (lambda ()
              (ggtags-mode 1)))

  ;; Elisp
  (add-hook 'lisp-mode-hook
            (lambda ()
              (ggtags-mode 1)))

#+END_SRC

#+RESULTS:
| lambda | nil | (ggtags-mode 1) |

